### 📖 Terraform Plan (infra/resources/dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.mcp_server.aws_api_gateway_deployment.mcp_server must be replaced
+/- resource "aws_api_gateway_deployment" "mcp_server" {
      ~ created_date = "2026-01-21T09:32:06Z" -> (known after apply)
      ~ id           = "4nauqg" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "c6b5410d91a95775ff361c9de584f59475482a7b"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.mcp_server.aws_api_gateway_integration.bedrock_search will be created
  + resource "aws_api_gateway_integration" "bedrock_search" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "awadwtf245"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:366865817117:function:dx-d-euc1-mcp-server-lambda-01/invocations"
    }

  # module.mcp_server.aws_api_gateway_method.search will be created
  + resource "aws_api_gateway_method" "search" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.Content-Type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_resource.search will be created
  + resource "aws_api_gateway_resource" "search" {
      + id          = (known after apply)
      + parent_id   = "3gckmfp48f"
      + path        = (known after apply)
      + path_part   = "search"
      + region      = "eu-central-1"
      + rest_api_id = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "4nauqg" -> (known after apply)
        id                    = "ags-awadwtf245-prod"
        tags                  = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mcp_server.aws_iam_policy.lambda_s3_access will be created
  + resource "aws_iam_policy" "lambda_s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for Lambda to generate pre-signed URLs for S3 knowledge base objects"
      + id               = (known after apply)
      + name             = "dx-d-euc1-lambda-s3-access-policy-01"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::dx-d-euc1-docs-kb-s3-01/*"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::dx-d-euc1-docs-kb-s3-01"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
      + tags_all         = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
    }

  # module.mcp_server.aws_iam_role_policy_attachment.lambda_s3_access will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dx-d-euc1-lambda-mcp-server-role-01"
    }

  # module.mcp_server.awscc_bedrock_data_source.docs must be replaced
-/+ resource "awscc_bedrock_data_source" "docs" {
      ~ created_at                           = "2025-12-23T15:56:21.671272593Z" -> (known after apply)
      ~ data_source_configuration            = {
          + confluence_configuration  = (known after apply)
          ~ s3_configuration          = {
              + bucket_owner_account_id = (known after apply)
              + inclusion_prefixes      = (known after apply)
                # (1 unchanged attribute hidden)
            }
          + salesforce_configuration  = (known after apply)
          + share_point_configuration = (known after apply)
          + web_configuration         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ data_source_id                       = "UAEJB6J11W" -> (known after apply)
      ~ data_source_status                   = "AVAILABLE" -> (known after apply)
      + description                          = (known after apply)
      + failure_reasons                      = (known after apply)
      ~ id                                   = "CBFLV0W1VR|UAEJB6J11W" -> (known after apply)
        name                                 = "dx-d-euc1-docs-bedrock-kb-01-dx-docs-data-source"
      + server_side_encryption_configuration = (known after apply)
      ~ updated_at                           = "2025-12-23T15:56:21.671272593Z" -> (known after apply)
      ~ vector_ingestion_configuration       = {
          ~ chunking_configuration              = { # forces replacement
              + fixed_size_chunking_configuration   = (known after apply)
              ~ hierarchical_chunking_configuration = {
                  ~ level_configurations = [
                      ~ {
                          ~ max_tokens = 1500 -> 4000
                        },
                      ~ {
                          ~ max_tokens = 300 -> 500
                        },
                    ]
                  ~ overlap_tokens       = 60 -> 150
                }
              + semantic_chunking_configuration     = (known after apply)
                # (1 unchanged attribute hidden)
            }
          + context_enrichment_configuration    = (known after apply)
          + custom_transformation_configuration = (known after apply)
          + parsing_configuration               = (known after apply)
        }
        # (2 unchanged attributes hidden)
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-id-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-id-func-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-v3-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-v3-func-snet-01"
    }

  # module.testing.azurerm_virtual_network_peering.common_to_tests["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "common_to_tests" {
      ~ allow_gateway_transit                  = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/virtualNetworkPeerings/dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-github-runner-snet-01",
        ]
        name                                   = "dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-pep-snet-01",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.testing.azurerm_virtual_network_peering.tests_to_common["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "tests_to_common" {
      ~ allow_forwarded_traffic                = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-e2e-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-e2e-vnet-01/virtualNetworkPeerings/dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-pep-snet-01",
        ]
        name                                   = "dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-github-runner-snet-01",
        ]
      ~ use_remote_gateways                    = true -> false
        # (6 unchanged attributes hidden)
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_endpoint.this will be destroyed
  # (because azurerm_cdn_frontdoor_endpoint.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_endpoint" "this" {
      - cdn_frontdoor_profile_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01" -> null
      - enabled                  = true -> null
      - host_name                = "dx-d-itn-test-fde-01-cccvdvdua8hrfrbp.a02.azurefd.net" -> null
      - id                       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/afdEndpoints/dx-d-itn-test-fde-01" -> null
      - name                     = "dx-d-itn-test-fde-01" -> null
      - tags                     = {
          - "BusinessUnit"   = "DevEx"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Dev"
          - "ManagementTeam" = "Developer Experience"
          - "ModuleName"     = "azure_cdn"
          - "ModuleSource"   = "DX"
          - "ModuleVersion"  = "0.4.0"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        } -> null
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_origin.this["primary"] will be destroyed
  # (because azurerm_cdn_frontdoor_origin.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_origin" "this" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/originGroups/dx-d-itn-test-fdog-01" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - host_name                      = "dxditntestst01.z38.web.core.windows.net" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/originGroups/dx-d-itn-test-fdog-01/origins/dx-d-itn-test-primary-fdo-01" -> null
      - name                           = "dx-d-itn-test-primary-fdo-01" -> null
      - origin_host_header             = "dxditntestst01.z38.web.core.windows.net" -> null
      - priority                       = 1 -> null
      - weight                         = 1000 -> null
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_origin_group.this will be destroyed
  # (because azurerm_cdn_frontdoor_origin_group.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_origin_group" "this" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01" -> null
      - id                                                        = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/originGroups/dx-d-itn-test-fdog-01" -> null
      - name                                                      = "dx-d-itn-test-fdog-01" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = true -> null

      - health_probe {
          - interval_in_seconds = 100 -> null
          - path                = "/" -> null
          - protocol            = "Https" -> null
          - request_type        = "HEAD" -> null
        }

      - load_balancing {
          - additional_latency_in_milliseconds = 50 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 3 -> null
        }
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_profile.this will be destroyed
  # (because azurerm_cdn_frontdoor_profile.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_profile" "this" {
      - id                       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01" -> null
      - name                     = "dx-d-itn-test-afd-01" -> null
      - resource_group_name      = "dx-d-itn-integration-rg-01" -> null
      - resource_guid            = "611a1385-60d2-476d-9fdd-7be459fc3217" -> null
      - response_timeout_seconds = 120 -> null
      - sku_name                 = "Standard_AzureFrontDoor" -> null
      - tags                     = {
          - "BusinessUnit"   = "DevEx"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Dev"
          - "ManagementTeam" = "Developer Experience"
          - "ModuleName"     = "azure_cdn"
          - "ModuleSource"   = "DX"
          - "ModuleVersion"  = "0.4.0"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        } -> null

      - identity {
          - identity_ids = [] -> null
          - principal_id = "5816b473-9320-4198-b339-64580ac18837" -> null
          - tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_route.this will be destroyed
  # (because azurerm_cdn_frontdoor_route.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_route" "this" {
      - cdn_frontdoor_custom_domain_ids = [] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/afdEndpoints/dx-d-itn-test-fde-01" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/originGroups/dx-d-itn-test-fdog-01" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/originGroups/dx-d-itn-test-fdog-01/origins/dx-d-itn-test-primary-fdo-01",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/ruleSets/ruleset",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "HttpsOnly" -> null
      - https_redirect_enabled          = true -> null
      - id                              = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/afdEndpoints/dx-d-itn-test-fde-01/routes/dx-d-itn-test-cdnr-01" -> null
      - link_to_default_domain          = true -> null
      - name                            = "dx-d-itn-test-cdnr-01" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
          - "Https",
        ] -> null
        # (1 unchanged attribute hidden)

      - cache {
          - compression_enabled           = false -> null
          - content_types_to_compress     = [] -> null
          - query_string_caching_behavior = "IgnoreQueryString" -> null
          - query_strings                 = [] -> null
        }
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_rule_set.this will be destroyed
  # (because azurerm_cdn_frontdoor_rule_set.this is not in configuration)
  - resource "azurerm_cdn_frontdoor_rule_set" "this" {
      - cdn_frontdoor_profile_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01" -> null
      - id                       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/ruleSets/ruleset" -> null
      - name                     = "ruleset" -> null
    }

  # module.testing.module.cdn_origin_storage_account.azurerm_storage_account.this will be destroyed
  # (because azurerm_storage_account.this is not in configuration)
  - resource "azurerm_storage_account" "this" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "ZRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Storage/storageAccounts/dxditntestst01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "italynorth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "dxditntestst01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://dxditntestst01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "dxditntestst01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://dxditntestst01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "dxditntestst01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://dxditntestst01.file.core.windows.net/" -> null
      - primary_file_host                  = "dxditntestst01.file.core.windows.net" -> null
      - primary_location                   = "italynorth" -> null
      - primary_queue_endpoint             = "https://dxditntestst01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "dxditntestst01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://dxditntestst01.table.core.windows.net/" -> null
      - primary_table_host                 = "dxditntestst01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://dxditntestst01.z38.web.core.windows.net/" -> null
      - primary_web_host                   = "dxditntestst01.z38.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "dx-d-itn-integration-rg-01" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "BusinessUnit"   = "DevEx"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Dev"
          - "ManagementTeam" = "Developer Experience"
          - "ModuleName"     = "azure_storage_account"
          - "ModuleSource"   = "DX"
          - "ModuleVersion"  = "2.1.3"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        } -> null
        # (57 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "cc8d0c03-ef7e-4989-9966-cea0db68d2f8" -> null
          - tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
          - type         = "SystemAssigned" -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      - static_website {
          - index_document     = "index.html" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 13 to add, 1 to change, 11 to destroy.

Warning: Reference to undefined provider

  on aws.tf line 12, in module "mcp_server":
  12:     aws.us_east_1 = aws.us-east-1

There is no explicit declaration for local provider name "aws.us_east_1" in
module.mcp_server, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us_east_1" with the source address "hashicorp/aws".
```

</details>
